# WallBaseConstraint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallBaseConstraint Property
ParameterTypeId Class See Also
---
"Base Constraint"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallBaseConstraint { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallBaseConstraint As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallBaseConstraint {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace